Зарплата_и_Управление_Персоналом/src/InformationRegisters/НастройкиПечатныхФорм/НастройкиПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПечатныхФорм</name>
  <resources>
    <name>СодержимоеДокумента</name>
    <type>
      <types>EnumRef.СодержимоеДокументов</types>
    </type>
  </resources>
  <resources>
    <name>БлокировкаСУсловием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторПечатнойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Зарплата_и_Управление_Персоналом/src/InformationRegisters/НастройкиПечатныхФорм/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Настройки() Экспорт
	
	НастройкиФорм = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиПечатныхФорм.ИдентификаторПечатнойФормы КАК ИдентификаторПечатнойФормы,
		|	НастройкиПечатныхФорм.СодержимоеДокумента КАК СодержимоеДокумента,
		|	НастройкиПечатныхФорм.БлокировкаСУсловием КАК БлокировкаСУсловием
		|ИЗ
		|	РегистрСведений.НастройкиПечатныхФорм КАК НастройкиПечатныхФорм";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Пока Выборка.Следующий() Цикл
		НастройкиФорм.Вставить(Выборка.ИдентификаторПечатнойФормы,
			Новый Структура("СодержимоеДокумента, БлокировкаСУсловием",
				Выборка.СодержимоеДокумента, Выборка.БлокировкаСУсловием));
	КонецЦикла;
	
	Возврат НастройкиФорм;
	
КонецФункции

Процедура ЗаполнитьНастройки() Экспорт
	
	ОбновитьНастройкиПечатныхФорм();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьНастройкиПечатныхФорм(ОбновитьЗаписи = Ложь)
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиПечатныхФорм");
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.НастройкиПечатныхФорм.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		ТаблицаНабора = НаборЗаписей.Выгрузить();
		
		ЗаписатьНабор = Ложь;
		НастройкиПечатныхФормПоУмолчанию = КадровыйЭДО.ОписанияНастроекПечатныхФормПоУмолчанию();
		Для Каждого НастройкиПечатнойФормы Из НастройкиПечатныхФормПоУмолчанию Цикл
			
			ЗаписьИдентификатора = ТаблицаНабора.Найти(НастройкиПечатнойФормы.ИдентификаторПечатнойФормы, "ИдентификаторПечатнойФормы");
			Если ЗаписьИдентификатора = Неопределено Тогда
				ЗаписатьНабор = Истина;
				ЗаполнитьЗначенияСвойств(ТаблицаНабора.Добавить(), НастройкиПечатнойФормы);
			ИначеЕсли ОбновитьЗаписи Тогда
				ЗаписатьНабор = Истина;
				ЗаполнитьЗначенияСвойств(ЗаписьИдентификатора, НастройкиПечатнойФормы);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗаписатьНабор Тогда
			НаборЗаписей.Загрузить(ТаблицаНабора);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			КадровыйЭДО.ИмяСобытияЖурналаРегистрации(
				НСтр("ru = 'Ошибка заполнения настроек печатных форм'", ОбщегоНазначения.КодОсновногоЯзыка())),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.НастройкиПечатныхФорм,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
